JLDominguezM/MCUNetESP/firmware/geomcu_count/sdkconfig.defaults
# XIAO ESP32-S3 Sense, 8 MB PSRAM (octal) + 8 MB flash (QIO 80 MHz).
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (octal, 80 MHz), arena de 6 MB + camera framebuffer caben aquí.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# TFLite Micro: kernels int8 optimizados por esp-nn (Xtensa SIMD).
CONFIG_NN_OPTIMIZED=y

# Inferencia full-image (16 patches) puede tardar ~30 s. WDT generoso.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=120
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_INT_WDT=n

# main_task stack 8 KB (TFLM Invoke pide >3.5 KB durante CONV).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Panic detallado.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y

# Partition table custom (partitions.csv): app slot 3 MB para modelo +
# imagen embebida + código.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Camera (cuando se active): SCCB en I2C port 0.
CONFIG_SCCB_HARDWARE_I2C_PORT0=y
# CONFIG_SCCB_HARDWARE_I2C_PORT1 is not set
